# coding=UTF-8（等号换为”:“也可以）
from urllib import request
from urllib import error
import re
import xlrd
import xlwt
import threading
import requests
def set_style(name, height, bold=False):
    style = xlwt.XFStyle()  # 初始化样式
    font = xlwt.Font()  # 为样式创建字体
    font.name = name  # 'Times New Roman'
    font.bold = bold
    font.color_index = 4
    font.height = height
    # borders= xlwt.Borders()
    # borders.left= 6
    # borders.right= 6
    # borders.top= 6
    # borders.bottom= 6
    style.font = font
    # style.borders = borders
    return style

def main(date):
    f = xlwt.Workbook()
    sheet2 = f.add_sheet(u'sheet2', cell_overwrite_ok=True)  # 创建sheet2
    row0 = [u'迁入城市',u'所在城市',u'lyd',u'迁出城市',u'所在城市',u'lyd']
     # 生成第一行
    for i in range(0, len(row0)):
        sheet2.write(0, i, row0[i], set_style('Times New Roman', 200, True))

    headers = {"User-agent":"Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/49.0.2623.221 Safari/537.36 SE 2.X MetaSr 1.0"}
    opener = request.build_opener()
    opener.add_headers = [headers]
    request.install_opener(opener)

    #riqi = input("日期是：")
    riqi=date
    print(riqi)
    #ID = [53,54,315,317,316,348,224,161,346,163,365]
    #name = ["长春","延边","南京","无锡","徐州","常州","苏州","南通","扬州","南昌","赣州"]
    #ID = [48,218,125,121,150,265,148,151,266,307,149,191,208,158,268,153,267,152,154,308,309]
    #name = ["哈尔滨","武汉","海口","三亚","石家庄","唐山","秦皇岛","邯郸","邢台","保定","沧州","廊坊","衡水","长沙","郑州","洛阳","安阳","新乡","商丘","周口","南阳"]
    ID=[33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186, 187, 188, 189, 190, 191, 192, 193, 194, 195, 196, 197, 198, 199, 200, 201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219, 220, 221, 222, 223, 224, 225, 226, 227, 228, 229, 230, 231, 232, 233, 234, 235, 236, 237, 238, 239, 240, 241, 242, 243, 244, 245, 246, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258, 259, 260, 261, 262, 263, 264, 265, 266, 267, 268, 269, 270, 271, 272, 273, 274, 275, 276, 277, 278, 279, 280, 281, 282, 283, 284, 285, 286, 287, 288, 289, 290, 291, 292, 293, 294, 295, 297, 298, 299, 300, 301, 302, 303, 304, 305, 306, 307, 308, 309, 310, 311, 312, 313, 314, 315, 316, 317, 318, 319, 320, 321, 322, 323, 324, 325, 326, 327, 328, 329, 330, 331, 332, 333, 334, 335, 336, 337, 338, 339, 340, 341, 342, 343, 344, 346, 347, 348, 349, 350, 351, 352, 353, 354, 355, 356, 357, 358, 359, 360, 361, 362, 363, 364, 365, 366, 367, 368, 369, 370, 371, 372, 373, 731, 770, 789, 792, 1214, 1215, 1216, 1217, 1218, 1277, 1293, 1498, 1515, 1641, 1642, 1643, 1644, 1713, 2031, 2032, 2033, 2358, 2359, 2634, 2654, 2734, 2757, 2758, 2911, 2912, 9001, 9002, 9003, 9004, 9005, 9006, 9007, 9008, 9009, 9010, 9011, 9012, 9013, 9014, 9015, 9016, 9017, 9018, 9019, 9020]
    name=['嘉峪关市', '金昌市', '白银市', '兰州市', '酒泉市', '大兴安岭地区', '黑河市', '伊春市', '齐齐哈尔市', '佳木斯市', '鹤岗市', '绥化市', '双鸭山市', '鸡西市', '七台河市', '哈尔滨市', '牡丹江市', '大庆市', '白城市', '松原市', '长春市', '延边朝鲜族自治州', '吉林市', '四平市', '白山市', '沈阳市', '阜新市', '铁岭市', '呼伦贝尔市', '兴安盟', '锡林郭勒盟', '通辽市', '海西蒙古族藏族自治州', '西宁市', '海北藏族自治州', '海南藏族自治州', '海东地区', '黄南藏族自治州', '玉树藏族自治州', '果洛藏族自治州', '甘孜藏族自治州', '德阳市', '成都市', '雅安市', '眉山市', '自贡市', '乐山市', '凉山彝族自治州', '攀枝花市', '和田地区', '喀什地区', '克孜勒苏柯尔克孜自治州', '阿克苏地区', '巴音郭楞蒙古自治州', '博尔塔拉蒙古自治州', '吐鲁番地区', '伊犁哈萨克自治州', '哈密地区', '乌鲁木齐市', '昌吉回族自治州', '塔城地区', '克拉玛依市', '阿勒泰地区', '山南地区', '林芝地区', '昌都地区', '拉萨市', '那曲地区', '日喀则地区', '阿里地区', '昆明市', '楚雄彝族自治州', '玉溪市', '红河哈尼族彝族自治州', '普洱市', '西双版纳傣族自治州', '临沧市', '大理白族自治州', '保山市', '怒江傈僳族自治州', '丽江市', '迪庆藏族自治州', '德宏傣族景颇族自治州', '张掖市', '武威市', '东莞市', '东沙群岛', '三亚市', '鄂州市', '乌海市', '莱芜市', '海口市', '蚌埠市', '合肥市', '阜阳市', '芜湖市', '安庆市', '北京市', '重庆市', '南平市', '泉州市', '庆阳市', '定西市', '韶关市', '佛山市', '茂名市', '珠海市', '梅州市', '桂林市', '河池市', '崇左市', '钦州市', '贵阳市', '六盘水市', '秦皇岛市', '沧州市', '石家庄市', '邯郸市', '新乡市', '洛阳市', '商丘市', '许昌市', '襄阳市', '荆州市', '长沙市', '衡阳市', '镇江市', '南通市', '淮安市', '南昌市', '新余市', '通化市', '锦州市', '大连市', '乌兰察布市', '巴彦淖尔市', '渭南市', '宝鸡市', '枣庄市', '日照市', '东营市', '威海市', '太原市', '文山壮族苗族自治州', '温州市', '杭州市', '宁波市', '中卫市', '临夏回族自治州', '辽源市', '抚顺市', '阿坝藏族羌族自治州', '宜宾市', '中山市', '亳州市', '滁州市', '宣城市', '廊坊市', '宁德市', '龙岩市', '厦门市', '莆田市', '天水市', '清远市', '湛江市', '阳江市', '河源市', '潮州市', '来宾市', '百色市', '防城港市', '铜仁地区', '毕节地区', '承德市', '衡水市', '濮阳市', '开封市', '焦作市', '三门峡市', '平顶山市', '信阳市', '鹤壁市', '十堰市', '荆门市', '武汉市', '常德市', '岳阳市', '娄底市', '株洲市', '盐城市', '苏州市', '景德镇市', '抚州市', '本溪市', '盘锦市', '包头市', '阿拉善盟', '榆林市', '铜川市', '西安市', '临沂市', '滨州市', '青岛市', '朔州市', '晋中市', '巴中市', '绵阳市', '广安市', '资阳市', '衢州市', '台州市', '舟山市', '固原市', '甘南藏族自治州', '内江市', '曲靖市', '淮南市', '巢湖市', '黄山市', '淮北市', '三明市', '漳州市', '陇南市', '广州市', '云浮市', '揭阳市', '贺州市', '南宁市', '遵义市', '安顺市', '张家口市', '唐山市', '邢台市', '安阳市', '郑州市', '驻马店市', '宜昌市', '黄冈市', '益阳市', '邵阳市', '湘西土家族苗族自治州', '郴州市', '泰州市', '宿迁市', '宜春市', '鹰潭市', '朝阳市', '营口市', '丹东市', '鄂尔多斯市', '延安市', '商洛市', '济宁市', '潍坊市', '济南市', '上海市', '晋城市', '南充市', '丽水市', '绍兴市', '湖州市', '北海市', '赤峰市', '六安市', '池州市', '福州市', '惠州市', '江门市', '汕头市', '梧州市', '柳州市', '黔南布依族苗族自治州', '保定市', '周口市', '南阳市', '孝感市', '黄石市', '张家界市', '湘潭市', '永州市', '南京市', '徐州市', '无锡市', '吉安市', '葫芦岛市', '鞍山市', '呼和浩特市', '吴忠市', '咸阳市', '安康市', '泰安市', '烟台市', '吕梁市', '运城市', '广元市', '遂宁市', '泸州市', '天津市', '金华市', '嘉兴市', '石嘴山市', '昭通市', '铜陵市', '肇庆市', '汕尾市', '深圳市', '贵港市', '黔东南苗族侗族自治州', '黔西南布依族苗族自治州', '漯河市', '扬州市', '连云港市', '常州市', '九江市', '萍乡市', '辽阳市', '汉中市', '菏泽市', '淄博市', '大同市', '长治市', '阳泉市', '马鞍山市', '平凉市', '银川市', '玉林市', '咸宁市', '怀化市', '上饶市', '赣州市', '聊城市', '忻州市', '临汾市', '达州市', '宿州市', '随州市', '德州市', '恩施土家族苗族自治州', '阿拉尔市', '石河子市', '五家渠市', '图木舒克市', '定安县', '儋州市', '万宁市', '保亭黎族苗族自治县', '西沙群岛', '济源市', '潜江市', '中沙群岛', '南沙群岛', '屯昌县', '昌江黎族自治县', '陵水黎族自治县', '五指山市', '仙桃市', '琼中黎族苗族自治县', '乐东黎族自治县', '临高县', '琼海市', '白沙黎族自治县', '东方市', '天门市', '神农架林区', '澄迈县', '文昌市', '澳门特别行政区', '香港特别行政区', '桃园市', '台北市', '南投县', '嘉义市', '彰化县', '新竹县', '澎湖县', '台东县', '宜兰县', '新北市', '基隆市', '屏东县', '嘉义县', '云林县', '花莲县', '台南市', '台中市', '新竹市', '高雄市', '苗栗县']

    for i in range(0,len(ID)):
        firsturl = "http://huiyan.baidu.com/migration/api/cityrank?dt=city&id="+str(ID[i])+"&type=move_in&date="+str(riqi)+"&callback=jsonp"
        data = requests.get(firsturl)
        #对Unicode编码进行改造
        pat = '{"city_name":"(.*?)","province_name":".*?","value":.*?}'
        pat1 = '{"city_name":".*?","province_name":".*?","value":(.*?)}'

        result = re.compile(pat).findall(str(data.content.decode("utf-8")).encode("utf-8").decode("unicode_escape"))
        result1 = re.compile(pat1).findall(str(data.content.decode("utf-8")).encode("utf-8").decode("unicode_escape"))
        column0 = result
        column1 = result1
        column2 = name[i]
        for i1 in range(0, len(column0)):
            sheet2.write(i1 + len(column0)*i+1, 0, column0[i1])# set_style('Times New Roman', 220)
        for i1 in range(0, len(column0)):
            sheet2.write(i1 + len(column0)*i+1, 1, column2)#, set_style('Times New Roman', 220)
        for i1 in range(0, len(column1)):
            sheet2.write(i1 +len(column0)*i+1, 2, column1[i1])#, set_style('Times New Roman', 220)

    for i in range(0, len(ID)):
        firsturl = "http://huiyan.baidu.com/migration/api/cityrank?dt=city&id="+str(ID[i])+"&type=move_out&date="+str(riqi)+"&callback=jsonp"
        # data2 = requests.get(firsturl).content()
        # data2 = data2.encode("utf-8").decode("unicode_escape")  #
        data2 = requests.get(firsturl)
        #对Unicode编码进行改造
        pat = '{"city_name":"(.*?)","province_name":".*?","value":.*?}'
        pat1 = '{"city_name":".*?","province_name":".*?","value":(.*?)}'

        result2 = re.compile(pat).findall(str(data2.content.decode("utf-8")).encode("utf-8").decode("unicode_escape"))
        result12 = re.compile(pat1).findall(str(data2.content.decode("utf-8")).encode("utf-8").decode("unicode_escape"))

        column0 = result2
        column1 = result12
        column2 = name[i]
        for i1 in range(0, len(column0)):
            sheet2.write(i1 + len(column0)*i+1, 3, column0[i1])#, set_style('Times New Roman', 220)
        for i1 in range(0, len(column0)):
            sheet2.write(i1 + len(column0) * i + 1, 4, column2)#, set_style('Times New Roman', 220)
        for i1 in range(0, len(column1)):
            sheet2.write(i1 + len(column0)*i+1, 5, column1[i1])#, set_style('Times New Roman', 220)

    print ("大吉大利，今晚吃鸡啊！")
    filename = 'D:/baidumap/baidumap'+str(riqi)+'.xls'
    f.save(filename)

import time
if __name__=='__main__':
    data=[]
    code=0
    while code==0:
        local=time.strftime("%Y%m%d", time.localtime())
        local=int(local)-1
        if local not in data:
            data.append(local)
            print('开始抓取')
            main(local)
            print('结束抓取')
        time.sleep(7200)

